app/controllers/talker_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def set_current_user
    if(session[:login_time] && session[:current_user] && session[:login_time] < Time.now + 4.hours)
      @current_user = User.find(session[:current_user])

INSERT INTO `msgs` (`user_id`, `msg`, `msg_return`, `created_at`, `updated_at`) VALUES (1, '你好', '{\"code\"=>100000, \"text\"=>\"hello，你是来陪我耍的吗？\"}', '2017-05-08 11:05:16', '2017-05-08 11:05:16')
---
  def index_ajax
    uri = URI(TULING_API)
    my_params = TULING_PARAMS.clone
    my_params[:info] = params['text']
    my_params[:userid] = @current_user.id.to_s
    response =  JSON.parse(Net::HTTP.post_form(uri, my_params).body)
    Msg.create(user_id:@current_user.id,msg:params['text'],msg_return:response.to_s)