app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `password`, `address`, `photo`, `email`, `created_at`, `updated_at`) VALUES ('bill', '', '', 'Screenshot_from_2017-05-03_11-35-29.png', '', '2017-05-08 06:37:29', '2017-05-08 06:37:29')
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`username` = 'bill' AND `users`.`password` = '123'
---
  def login
    users = User.where(username: params[:user][:username],password: params[:user][:password])